{
    "Projects": [
        {
            "Project_ID": "1",
            "Project_Name": "Makarov - Web",
            "Project_TagLine": "Contactless Office Management App",
            "Summary": "Makarov is a Covid19 utility based office management SaaS product, enabling digitized employee, visitor, attendance and meetings management with a no-touch/contact approach using QR Code Scanning and Face Recognition Technologies.",
            "Problem_Statement": "In the Covid Affected world, every office needed to maintain a social distancing and contactless policy.\nThe company decided to create a SaaS application for small offices inorder to help them digitize their day-to-day office tasks like:\na) Employee Management b) Visitor Management c) Attendance Management d) In-Person Meetings Management",
            "Solution_Provided": "A SaaS product was created using Multi-Tenancy and MVC architecture. The website had the following user role views:\na) Super Admin User b) Admin User b) Client Admin User c) Employees d) Visitors\n\nThe solution offered the following features:\na) Admin Panels b) Pricing Module c) Employee Management Module d) Visitor Management Module e) Attendance Management Module f) In-Person Meetings Management Module g) Leave Management Module h) Dashboards and Analytics",
            "Impact": "The product created provided ease of contactless office management which inturn led to:\na) Proper Record Maintainence b) Easy Governance c) Reduction in Request TAT d) Streamlining Processes e) Increase in Company Revenue",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Project Lead, Full Stack Developer",
            "Client_Industry": "IT",
            "Domain": "Web Application",
            "Tags": "Web Development, Data Analysis, Data Visualization",
            "Technology_Stack": "Python, Flask, OpenCV, DLIB, HTML, CSS, JavaScript, Bootstrap, MySQL",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "2",
            "Project_Name": "Makarov - Mobile",
            "Project_TagLine": "Contactless Office Management App",
            "Summary": "Makarov is a Covid19 utility based office management SaaS product, enabling digitized employee, visitor, attendance and meetings management with a no-touch/contact approach using QR Code Scanning and Face Recognition Technologies.",
            "Problem_Statement": "In the Covid Affected world, every office needed to maintain a social distancing and contactless policy.\nThe company decided to create a SaaS application for small offices inorder to help them digitize their day-to-day office tasks like:\na) Employee Management b) Visitor Management c) Attendance Management d) In-Person Meetings Management",
            "Solution_Provided": "A Mobile App which works in coordination with the Web App was created using MVVM architecture. The application uses technologies like QR Code Scanner & Face Recognition. \n\nApplication Features:\na) Profile Management b) Visitor Scheduling/Registration c) Attendance Management d) In-person Meetings Responses and Room Scheduling e) Leave Management",
            "Impact": "The app created provided ease of contactless office management which inturn led to:\na) Streamlining Processes b) Reduction in Request TAT",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Project Lead, Mobile App Developer",
            "Client_Industry": "IT",
            "Domain": "Mobile Application",
            "Tags": "Mobile App Development, Computer Vision, Face Recognition",
            "Technology_Stack": "Android Studio (Java + XML), Firebase, Twilio, Python, Flask, OpenCV, MySQL",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "3",
            "Project_Name": "Facify",
            "Project_TagLine": "Intelligent Face Image Moderator",
            "Summary": "Facify is a Face Detection and Recognition based AI engine, which automates the task of reducing false/unacceptable Passport Size Images, uploaded by candidates while registration.",
            "Problem_Statement": "Every year 1M+ students register for examinations. A part of registration form requires them to upload passport size images. Often these images lack in quality, have occluded faces or are even incorrect. It takes a lot of time and effort to manually validate the acceptance of each uploaded image.\n\nThe client desired a solution which can automate this tedious task basis their SOPs and reduce manual efforts.",
            "Solution_Provided": "A state-of-the-art AI Engine was created which can automate the image quality checking tasks using Face Detection, Object Detection, Face Recognition, Landmark Detection and other image processing algorithms.\n\nThe solution was deployed on a Digital Ocean Server and made accessible in the form of APIs which were later attached in their existing Web based tool.",
            "Impact": "The false/unacceptable image upload rate was reduced by 77%.\n\nWith a robust and flexible automation engine in place, solution helped in:\na) Reduction in manual effort by 80% b) Reduction in TAT by 20% c) Bulk Processing d) Easy summarised views",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "AI Engineer",
            "Client_Industry": "Education",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, Face Detection, Face Recognition, Object Detection. Landmark Detection, Automation",
            "Technology_Stack": "Python, Flask, OpenCV, DLIB, TensorFlow, Keras, MS SQL Server",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "4",
            "Project_Name": "Exam Proctor",
            "Project_TagLine": "Intelligent Live Video Proctor",
            "Summary": "Exam Proctor is a remote AI based video proctoring tool which can raise alerts and generate a cheating score anytime a candidate is suspected of cheating in an online examination.",
            "Problem_Statement": "Every year Millions of students apply for online examinations. While some exams require candidate to give exams from a designated centre, there are still some exams which allow them to give exams from their home with their webcam feed visible.\n\nOften it's found to be easier for candidates to cheat in such examinations, and a remote proctor has to sit and monitor their feeds. But it is difficult for a single proctor to pay attention to all incoming feeds at once, so a solution is required which can raise alerts to the proctor whenever a candidate is suspected of cheating, so the proctor can take necessary measures.",
            "Solution_Provided": "An intelligent self-sufficient AI Engine was developed which can automate the candidate feed monitoring tasks in near real-time using Face Detection, Face Recognition, Landmark Detection, Eye Tracking and other computer vision algorithms.\n\nThe solution was deployed on a custom Azure Server and made accessible in the form of APIs which were later attached in their existing Web based tool.",
            "Impact": "The cheating cases were reduced by 52%.\n\nWith a robust and flexible automation engine in place, solution helped in:\na) Reduction in manual effort by 72% b) Reduction in TAT by 13% c) Bulk Processing d) Easy summarised views e) Final Reports",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "AI Engineer",
            "Client_Industry": "Education",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, Face Detection, Face Tracking, Face Recognition, Landmark Detection, Eye Tracking, Data Visualization",
            "Technology_Stack": "Python, Flask, OpenCV, DLIB, TensorFlow, Keras, MS SQL Server",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "5",
            "Project_Name": "SnipNow",
            "Project_TagLine": "OCR Based Text Snipping Tool",
            "Summary": "SnipNow is a smart question paper text snipping tool built using Computer Vision, OCR and NLP technologies to facilitate proper text extraction from images.",
            "Problem_Statement": "In most examinations, question papers are shared in an image format. These images often contains answers as well.\nThe client currently uses a manual approach to separate questions and answers from these images and later manually type them to convert into text format.\n\nDue to the manual efforts, there's a room for errors in the form of improper snipping or misspelled words. Thus, an automated smart tool is required to reduce manual efforts and errort rate for this task.",
            "Solution_Provided": "An intelligent web based image snipping tool is created to upload, snip questions & answers separately and convert them into text format to be stored on a cloud database.\nTechnologies like Computer Vision, Image Segmentation, Image Processing, OCR are used to localize and extract texts from the localized regions. Later an NLP based spell checker and text similarity algorithm is used to validate the extracted text.\n\nThe solution was deployed on a custom Azure Server and made accessible in the form of APIs which were later attached in the Web based tool.",
            "Impact": "The error rate was reduced by 83%.\n\nWith a robust and flexible automation tool in place, solution helped in:\na) Reduction in manual effort by 63% b) Reduction in TAT by 46% c) Bulk Processing d) Reduction in space utilized by 13% e) Streamlining the overall processes",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "AI Engineer",
            "Client_Industry": "Education",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, OCR, Image Segmentation, NLP",
            "Technology_Stack": "Python, Flask, OpenCV, PyTesseract",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "6",
            "Project_Name": "e-Verified",
            "Project_TagLine": "Mobile based Candidate Verification",
            "Summary": "e-Verified is a mobile app based candidate identity verification system which can authenticate if the person appearing for the exam is the actual person who registered for it.",
            "Problem_Statement": "It is found that even with the most modern schooling and authorization systems, candidates still find a way to cheat in examinations. One of those ways is to let someone else take examination instead for them.\n\nUsually there is a manual process to validate a person's identity during examinations but often times it's difficult to verify people solely basis of their demographic details and images. Thus an AI intervention is required to reduce such cheating cases and manual verification error rate.",
            "Solution_Provided": "A mobile application is built using already existing APIs and face recognition technology to verify candidate identities. An additional hardware embedded with mobile application to scan Eyes to extract and process clear Iris Images for candidate verification in real time.\n\nThe solution offered the following ways to verify a candidate's identity:\na) QR Code Scanning b) Govt. ID Authentication c) Face Recognition d) Iris Recognition",
            "Impact": "With a robust and flexible tool in place, solution helped in:\na) Reduction in error effort by 75% b) Reduction in TAT by 12% c) Streamlining the overall processes",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Project Lead, Mobile App Developer, AI Engineer",
            "Client_Industry": "Education",
            "Domain": "Mobile Application",
            "Tags": "Mobile App Development, Hardware Connection, Computer Vision, Face Recognition",
            "Technology_Stack": "Android Studio (Java + XML), Firebase, Twilio, Python, Flask, OpenCV, DLIB, IriCore, IriShield",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "7",
            "Project_Name": "Insa-Chatbot",
            "Project_TagLine": "Smart Insurance Enquiry Assistant",
            "Summary": "Insa is a chatbot implemented to reduce call center traffic and assist customers with easy enquiries and reduce request turn around time.",
            "Problem_Statement": "The client is an insurance company which receives a large volume of enquiry calls at their call centers. This leads to increase in hiring costs especially during the AE period. Due to the large volumes there's always a risk of not meeting the SLA and increase in request resolution TAT.\n\nThus, a chat based solution is required which can assist users with their common queries and direct them to the required resources.",
            "Solution_Provided": "Call Transcripts were analyzed to find the top call volume topics. Basis these themes, a chatbot was designed and implemented using Rasa (a popular chatbot framework). \n\nThe chatbot offered the following features:\na) Request Resolution for common themes b) Automated enquiry ticket raising and allocation c) Redirecting users to the required links/media for help d) Connecting users with associates in case the chatbot was unable to resolve the user's queries\n\nThe solution was later embedded into the client website.",
            "Impact": "The chatbot offered reduction in call center traffic by 15%.\n\nThe overall impact includes:\na) Reduction in manual effort b) Cost Savings c) Reduction in TAT d) Maintaining SLA",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Project Lead, AI Engineer",
            "Client_Industry": "Insurance",
            "Domain": "Artificial Intelligence",
            "Tags": "NLP, Chatbot, Text Clustering, Topic Mining, Text Classification, Text Analysis",
            "Technology_Stack": "Python, Rasa, NLTK, Scikit-Learn, Pandas, NumPy, Flask",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "8",
            "Project_Name": "Ensaan - Doctors",
            "Project_TagLine": "Mobile App for Digital Consultation",
            "Summary": "Ensaan is a mobile application aimed to provide a digital medical consultation experience for doctors and patients, enabling remote consultations anywhere in the world.",
            "Problem_Statement": "The client desired a digital healthcare product which can connect doctors and patients for remote medical consultations, easy medical records storage and provide a one stop solution to all remote consultation needs.\n\nThe app should be able to:\na) Register doctors b) List & Edit services offered c) Remote Medical Consultations d) Appointment Scheduler e) Medicine Alerts and Reminders ",
            "Solution_Provided": "A mobile application is created which acts as a one stop solution for remote medical consultations, patient record maintainence, online pharmacy and medical alerts.",
            "Impact": "A strong and robust app provides the doctors the following benefits:\na) Register doctors b) List & Edit services offered c) Remote Medical Consultations d) Appointment Scheduler e) Medicine Alerts and Reminders f) Request and view patient medical reports",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Mobile App Developer",
            "Client_Industry": "Health & Welfare",
            "Domain": "Mobile Application",
            "Tags": "Mobile App Development",
            "Technology_Stack": "Android Studio (Java + XML), Firebase, Twilio",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "9",
            "Project_Name": "Ensaan - Patients",
            "Project_TagLine": "Mobile App for Digital Consultation",
            "Summary": "Ensaan is a mobile application aimed to provide a digital medical consultation experience for doctors and patients, enabling remote consultations anywhere in the world.",
            "Problem_Statement": "The client desired a digital healthcare product which can connect doctors and patients for remote medical consultations, easy medical records storage and provide a one stop solution to all remote consultation needs.\n\nThe app should be able to:\na) Register patients b) Book services offered c) Remote Medical Consultations d) Appointment Scheduler e) Medicine Alerts and Reminders ",
            "Solution_Provided": "A mobile application is created which acts as a one stop solution for remote medical consultations, patient record maintainence, online pharmacy and medical alerts.",
            "Impact": "A strong and robust app provides the patients the following benefits:\na) Register patients b) Book services offered c) Remote Medical Consultations d) Appointment Scheduler e) Medicine Alerts and Reminders  f) Store and share Medical Reports",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Mobile App Developer",
            "Client_Industry": "Health & Welfare",
            "Domain": "Mobile Application",
            "Tags": "Mobile App Development",
            "Technology_Stack": "Android Studio (Java + XML), Firebase, Twilio",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "10",
            "Project_Name": "Neighborhood",
            "Project_TagLine": "Mobile App for Events and Experiences",
            "Summary": "Neighbourhood is a mobile application created to advertise food, events and experiences in the city and enable users to browse through the catalog based on their preferences and book the ones they like.",
            "Problem_Statement": "The client comes from a travel background and wanted to create an application which can be used by users to advertise any food offerings, events and experiences for the travellers in the city.\n\nThe application should also be able to allow travellers to book any of those services and contact the providers.",
            "Solution_Provided": "A mobile app was created with 2 levels of users:\na) Providers b) Travelers\n\nThe app allowed users to list, remove, update and advertise the services they offered while travelers can book/cancel booking of these services.\nThe app also used a GPS navigation functionality to enable users to filter the services nearest to them along with any other filters/preferences they selected.",
            "Impact": "A strong and robust app provides the users the following benefits:\na) Register as a provider/traveler b) List/Book/Advertise services offered c) Find services based on distance & preferences d) Track event details in stories",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "Mobile App Developer, AI Engineer",
            "Client_Industry": "Travel",
            "Domain": "Mobile Application",
            "Tags": "Mobile App Development, Computer Vision",
            "Technology_Stack": "Android Studio (Java + XML), Firebase, Twilio, Python, Flask, OpenCV, DLIB",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "11",
            "Project_Name": "FaceRec",
            "Project_TagLine": "Face Recognition based Authentication Engine",
            "Summary": "FaceRec is a custom Face Recognition based Authentication Engine support 10+ Web and Mobile products with easy high accuracy and quick response time.",
            "Problem_Statement": "The organization wanted to create a highly secure and modern authentication engine which can empower its multiple projects while at the same time offering high reliability and accuracy along with quick response time.\n\nThe AI Engine should be able to train, test, monitor, retrain models for individual as well as all projects aligned to it while at the same time following the ethical guidelines listed for storing and maintaining face images.",
            "Solution_Provided": "Using state-of-the art Computer Vision Algorithms, a powerful and secure Face Recognition based AI Engine was created, hosted on our custom Azure Server, made accessible in the form of APIs.\n\nThe solution allowed project owners to connect to the AI Engine, store user face images in a secure format, train/re-train face recognition models for individual users and at bulk, monitor model performance and use the plugin created to embed in web/mobile apps for Face Authentication purposes.",
            "Impact": "With a highly secure and efficient AI Backend at place, the solution offers the following services:\na) Supporting 10+ projects in real time b) Easy face image registration c) Model Training/Retraining d) Face Recognition based login/authentication e) Model Performance Monitoring analytics",
            "Organization": "SysQuo Innovation Pvt. Ltd.",
            "Role": "AI Engineer",
            "Client_Industry": "IT",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, Face Detection, Face Recognition, Object Detection. Landmark Detection",
            "Technology_Stack": "Python, Flask, OpenCV, DLIB, TensorFlow, Keras, MySQL",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "12",
            "Project_Name": "YSA Claims Forecasting & Headcount Estimation",
            "Project_TagLine": "Future Demand Forecasting and Resource Management",
            "Summary": "A time series forecasting project to predict the future monthly incoming claim volumes and basis that estimate the headcount required at different domain hierarchies/levels with easy and flexible drill-up/drill-down functionality.",
            "Problem_Statement": "YSA Claims business handles claims management under multiple propiertary platforms. The claim volumes varies on a month-to-month basis, thus, they need to plan adequate workforce to manage any incoming volumes well.\n\nA future forecast on claim volumes will help business in efficient resource management, workforce trainings and meeting the desired SLA.",
            "Solution_Provided": "The YSA Claims Volumes has been forecasted using state-of-the-art ML Algorithms and detailed Time Series Analysis; which in-turn helped in Headcount Estimation.\n\nThe solution offers the following features:\na) Flexibility to roll-up forecasted numbers at multiple levels (Client/ Queue / POD / Platform) b) Provision of High & Low Forecast bands. c) Addition of Volumes and FTE Simulations for better decision making.",
            "Impact": "Accuracy for FY 2021-22 stands at 95%.\n\nWith a robust and accurate model in place, it has been helpful for business to:\na) Plan the headcount in an optimum way - enabling cross-trainings and realignment within PODs b) Reduction in TAT and managing SLA better c) Offer a view at multiple levels for better decision making..",
            "Organization": "Wipro",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Operations",
            "Domain": "Data Science",
            "Tags": "Time Series Forecasting, Regression, Data Analysis",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, SciPy, Pandas, NumPy, Seaborn, Matplotlib, Plotly",
            "Status": "Quarterly Refresh",
            "Link": "N/A"
        },
        {
            "Project_ID": "13",
            "Project_Name": "Compliance Forecasting",
            "Project_TagLine": "Future Demand Forecasting and Resource Management",
            "Summary": "A time series forecasting project to predict the future monthly incoming case volumes and basis that estimate the headcount required at different services.",
            "Problem_Statement": "The Compliance Business encompasses 3 different services. The business needs to plan and manage resources to meet any case volumes received under each service.\n\nA visibility over future demands would help business in improving overall TAT ad manage workforce better.",
            "Solution_Provided": "The trends and seasonality varies for each service on a month-to-month basis.\n\nWe've implemented an ensemble of predictive ML algorithms prominent in Time Series Analysis domain. Case Volumes were forecasted, which helped in headcount estimation.\n\nThe solution presented interpretation of forecasted volumes at Service Level.",
            "Impact": "Accuracy for FY 2021-22 stands at 101% (1% underforecasted).\n\nWith a robust and accurate model in place, it has been helpful for business to:\na) Plan the headcount in optimum way - enabling cross training and realignment within PODs b) Reduction in TAT and managing the SLA effectively.",
            "Organization": "Wipro",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Operations",
            "Domain": "Data Science",
            "Tags": "Time Series Forecasting, Regression, Data Analysis",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, SciPy, Pandas, NumPy, Seaborn, Matplotlib, Plotly",
            "Status": "Quarterly Refresh",
            "Link": "N/A"
        },
        {
            "Project_ID": "14",
            "Project_Name": "iWFM",
            "Project_TagLine": "Workforce Allocation Management Tool",
            "Summary": "An Analytical initiative to operationalize Analytical results in real life by providing a workforce management plan on a daily/weekly/monthly level basis the forecast offered for different businesses/services/platfoms.",
            "Problem_Statement": "Wipro offers multiple services to its clients and it has different teams for different operational tasks.  Most of these teams work on ticket volumes received daily.\n\nWhile some services follow a standard year-around ticket processing, others mifht follow a window specific ticket volume processing. Added to this they've high demand periods as well. Thus, a future forecast would be helpful for businesses to plan and manage their resources effectively on a monthly, weekly and daily level.",
            "Solution_Provided": "Volumes have been forecasted using smart ML Algorithms basis Time Series Analysis for year-around services. A simulation module has been developed which provides volume distributions for window-specific services across clients on a daily, weekly & monthly level using 7 different distribution patterns.\n\nThe forecasts is thus used for Headcount estimation for business, basis various assumptions shared.",
            "Impact": "With a robust and accurate tool in place, it has been helpful for business to: \na) Properly distribute Window Volumes, rather than using standard approaches b) Efficiently plan and manage Headcount c) Reducing the TAT and managing the SLA d) Offer a view at multiple levels for better decision making.",
            "Organization": "Wipro",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Operations",
            "Domain": "Desktop Application",
            "Tags": "Data Analysis, Time Series Forecasting, Data Visualization, Desktop App Development, Data Visualization, Automation",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, Pandas, NumPy, Seaborn, Matplotlib, Plotly, VBA",
            "Status": "Ongoing",
            "Link": "N/A"
        },
        {
            "Project_ID": "15",
            "Project_Name": "DC Workflow Analytics",
            "Project_TagLine": "Workflow Automation and Visualization Tool",
            "Summary": "An Automation & Visualization tool designed to reduce manual efforts, save time and provide easily accessible/shareable dashboards to empower quick data-driven decision making.",
            "Problem_Statement": "DC business as part of their regular deliverables needs to generate the work inflow report and send it across to the team via email on daily basis that costs them 14 hours of production time (2 hours * 7 managers).\n\nThey also needed a dynamic dashboard reflecting all the important KPIs to understand the current situation and trend of inflow.",
            "Solution_Provided": "Built an automation tool that enables users to generate reports and can be auto mailed on a single click to the respective teams or members.\n\nBuilt an interactive dashboard as per the required business KPIs to simplify the inventory tracking task for Ops team.",
            "Impact": "Saving the daily 14 hours of production time (data processing + auto mailer)\n\nInteractive dashboard allowing Ops Leads to take quick decisions without going into descriptive details.",
            "Organization": "Wipro",
            "Role": "Data Analyst, Business Consultant",
            "Client_Industry": "Operations",
            "Domain": "Data Science",
            "Tags": "Data Analysis, Data Visualization, Automation",
            "Technology_Stack": "Python, Excel, SQL, Pandas, NumPy, Seaborn, Matplotlib, Plotly, VBA",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "16",
            "Project_Name": "WordsWorth",
            "Project_TagLine": "Intelligent Text Analytics Utility Tool",
            "Summary": "WordsWorth is an intelligent drag & drop based NLP utility tool built to simplify and automate Text Analytics with minimal user intervention to save time and effort.",
            "Problem_Statement": "Business and teams across various domain work with different types of text data such as Surveys, Chatboxes, Call Transcripts, etc.\nThere is always a need for analyzing these text inputs to derive actionable insights.\n\nThe idea is to build an automated NLP tool which can reduce execution time and efforts for different processes in the Text Analytics domain while still providing quality results.",
            "Solution_Provided": "The tool is build using latest UI Frameworks and is backed with a robust AI-ML Algorithm Backend. \n\nThe tool provides different operational capabilities ranging from high-level text exploration to highly-complex tasks such as Text Bucketing or Text Classification.",
            "Impact": "The tool offers the following features to its users:\na) Text Exploration b) Sentiment Analysis c) Text Bucketing d) Text Classification\n\nThe automation nature of the tool helps in:\na) Saving time b) Reducing manual efforts c) Reproducible results",
            "Organization": "Wipro",
            "Role": "Lead Analyst, Desktop App Developer",
            "Client_Industry": "Operations",
            "Domain": "Desktop Application",
            "Tags": "NLP, Desktop App Development, Sentiment Analysis, Text Clustering, Topic Mining, Text Classification, Text Analysis, Automation",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, NLTK, Spacy, Gensim, TensorFlow, Keras, Pandas, NumPy, SciPy, PCA, Matplotlib, Seaborn, Plotly, PyQT5",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "17",
            "Project_Name": "Google HR Services Forecasting",
            "Project_TagLine": "Future Demand Forecasting and Resource Management",
            "Summary": "A time series forecasting project to predict the future monthly incoming case volumes and basis that estimate the headcount required at different services.",
            "Problem_Statement": "Busines needs the apt. workforce to handle Google HR for Google employees/candidates. This requires long training and sessios, so business wants to have a visibility on the workforce from future perspective, to be better prepared for future to handle the cases and ensure the operational timelines are met.\n\nThe primary requirement is to forecast the number of cases for different queues/platforms for Google HR at monthly level. Business will further use this forecast for FTE Estimation at monthly level.",
            "Solution_Provided": "Provided a modeler using regression and some ensemble techniques that predicts cases for each queue under Google HR at monthly level.\n\nBusiness uses these projections for FTE Estimation.",
            "Impact": "With a robust and flexible modeler in place:\na) This leads to cost savings by cutting down excess contractor hiring. b) Better management of resources c) Time savings - meeting the SLA and reduction in TAT.",
            "Organization": "Wipro",
            "Role": "Data Scientist, Business Consultant",
            "Client_Industry": "Operations",
            "Domain": "Data Science",
            "Tags": "Time Series Forecasting, Regression, Data Analysis",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, SciPy, Pandas, NumPy, Seaborn, Matplotlib, Plotly",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "18",
            "Project_Name": "DVS Survey Analysis",
            "Project_TagLine": "Customer Satisfaction Survey Analytics",
            "Summary": "CSAT Survey Analytics aimed at finding out the top negative experience areas for process improvement, identification of at-risk client(s) accounts and improvement of overall customer experience.",
            "Problem_Statement": "DVS, an offered service from Alight, wanted to gauge the overall customer experience and a survey has been rolled out for the same purpose.\n\nThrough the survey, business wanted to know the major issues faced by participants during verification process, so that the opportunity areas can be identified and suitable action can be taken.",
            "Solution_Provided": "Analysis done on the free text/comments with the help of NLP Algorithms.\nSentiment Analysis to understand overall customer experience.\nTopic Mining across negative feedbacks using ML Algorithms to identify the pain areas for customers to serve them better in future.",
            "Impact": "Reduction in Negative Sentiment Score across clients.\nReduction in overall Volume of topics identified for Negative Feedback.\nIdentification of at-risk clients.",
            "Organization": "Wipro",
            "Role": "Data Analyst, Business Consultant",
            "Client_Industry": "Operations",
            "Domain": "Data Science",
            "Tags": "NLP, Sentiment Analysis, Text Clustering, Topic Mining, Text Classification, Text Analysis, Data Analysis, Data Visualization",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, NLTK, Spacy, Gensim, TensorFlow, Keras, Pandas, NumPy, SciPy, PCA, Matplotlib, Seaborn, Plotly, Tableau",
            "Status": "Quarterly Refresh",
            "Link": "N/A"
        },
        {
            "Project_ID": "19",
            "Project_Name": "Face Mask Detection",
            "Project_TagLine": "Covid19 Computer Vision Utility",
            "Summary": "A Face Detection and Image Classification Utility to detect if a person is wearing face masks or not?",
            "Problem_Statement": "In the covid struck world, face masks worked as one of our first line of defense against the virus. But people often tried to not wear masks, even at public places.\n\nThis POC aims at creating a face mask detection algorithm which identifies if a person is wearing a face mask or not from the inputed camera feeds? ",
            "Solution_Provided": "Using modern face detection, face tracking, image processing, object detection and image classification algorithms, a solution was created to predict if a person is wearing a face mask or not in real time for a live camera video feed.\n\nThe project involved creation of custom face mask vs no-mask dataset, training and testing pipelines along with a feature to test/predict in real time.",
            "Impact": "With a robust model at place, face mask detection challenge was solved with an accuracy of 93%.",
            "Organization": "Personal",
            "Role": "Project Lead, AI Engineer",
            "Client_Industry": "Health & Welfare",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, Face Detection, Face Recognition, Object Detection. Landmark Detection",
            "Technology_Stack": "Python, OpenCV, DLIB, TensorFlow, Keras",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "20",
            "Project_Name": "Social Distancing Violation Detection",
            "Project_TagLine": "Covid19 Computer Vision Utility",
            "Summary": "An Object Detection and Tracking Utility to detect if there's a social distancing violation in a public place or not?",
            "Problem_Statement": "In the covid struck world, social-distancing worked as one of our first line of defense against the virus. But people often tend to violate the social distancing norms, even at public places.\n\nThis POC aims at creating a social distancing violation detection algorithm which identifies if at a given moment any social distancing violations are being done or not from the inputed camera feeds? ",
            "Solution_Provided": "Using modern object detection, object tracking, image processing and statistical algorithms, a solution was created to predict if a 2 or more people are closer than threshold distance or not in real time for a live camera video feed to predict if there is a social distancing violation or not.\n\nThe solution uses modern transfer learning principles to detect people in an image using a Yolo-v3 model as a base.",
            "Impact": "With a flexible model at place, social distancing violations detection challenge was solved with an accuracy of 88%.",
            "Organization": "Personal",
            "Role": "Project Lead, AI Engineer",
            "Client_Industry": "Health & Welfare",
            "Domain": "Artificial Intelligence",
            "Tags": "Computer Vision, Object Detection. Object Tracking",
            "Technology_Stack": "Python, OpenCV, DLIB, TensorFlow, Keras",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "21",
            "Project_Name": "Dr. Digi",
            "Project_TagLine": "Smart Appointment Scheduler Chatbot",
            "Summary": "Dr. Digi is a chatbot solution implemented to get Covid related updates, find near by hospitals, clinics and chemists, book appointments and take covid risk tests.",
            "Problem_Statement": "The idea is to create a chat assistant which can act as a one stop solution to book appointments and find information related to hospitals, chemists, clinics and covid without going any place else.\n\nThe POC should also be able to let users take covid risk tests to identify if they might be at risk for covid or not?",
            "Solution_Provided": "A chatbot was creating using Google's Dialogflow client and integrated with google assistant. \n\nThe chatbot is able to perform the following tasks:\na) Information about nearby Hospitals/Clinics/Pharmacies b) Information related to Covid19 c) Book appointments with pre-registered clinics d) Covid19 Risk tests",
            "Impact": "The chatbot offers the following benefits to its users:\na) Quick Appointment Bookings b) Ease of access of required information c) Covid Risk Tests",
            "Organization": "Personal",
            "Role": "Project Lead, AI Engineer",
            "Client_Industry": "Health & Welfare",
            "Domain": "Artificial Intelligence",
            "Tags": "NLP, Chatbot, Text Clustering, Topic Mining, Text Classification, Text Analysis",
            "Technology_Stack": "Python, Dialogflow, NLTK, Scikit-Learn, Pandas, NumPy, Flask",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "22",
            "Project_Name": "Employee Attrition Predictor",
            "Project_TagLine": "Survival/Attrition Analytics",
            "Summary": "A Survival Analysis project to analyze how many employees are prone to attrite at a given time basis associated features and predict if an employee will attrite or not basis the inputed features.",
            "Problem_Statement": "It is found that any industry suffers from a risk of employee attrition at any given time due to numerous reasons\n\nThis project aims to run a survival/attrition analysis on an employee data set to find out top correlations for employee attrition at an organization and to find out if any employee will attrite or not?",
            "Solution_Provided": "Using Survival Analysis, a case study was proposed to find out common potential factors for employee attrition. The solution also aimed at creating simulations for finding out what kind of employees are at a risk of attriting and how long will it take for an employee to attrite.\n\nA classification model pipeline was built to predict if an employee for the given input features would attrite or not along with the confidence score for the same.",
            "Impact": "The case study aims at helping out organizations to work on factors which leads to high attrition, a separate deep dive was suggested for Root Cause Analysis.\n\nThe attrition prediction model provides an accuracy of 87%.",
            "Organization": "Personal",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Health & Welfare",
            "Domain": "Data Science",
            "Tags": "Survival Analytics, Classification, Data Analysis",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, Lifelines, PySurvival, SciPy, Pandas, NumPy, Seaborn, Matplotlib, Plotly",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "23",
            "Project_Name": "Customer Advertising Segmentation",
            "Project_TagLine": "Customer Clustering and Insights",
            "Summary": "A Customer Segementation/Clustering Project to find out different user groups for a service and consult an optimal advertisement plan to target different customer cohorts.",
            "Problem_Statement": "As a retail service company, the organization has to advertise its products to its customers. Usually these advertisements cost a lot and different user groups react positively to different sort of advertisements.\n\nThe requirement is to analyze and find different customer cohorts and analyze each cohort to draw insights to suggest which advertisement method will be the best for which cohort?",
            "Solution_Provided": "PCA and Kmeans Clustering algorithm was used to create customer cohorts and later each cluster was analyzed to understand their behavior.\n\nLater using these information an advertisement plan was suggested for each cohort to minimize advertisement campaign costs while at the same time improving customer acquisition/retention rate.",
            "Impact": "The case study aims at understanding different user behaviors and recommend organization the best plan to target each customer at the same time minimizing the marketing spend.",
            "Organization": "Personal",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Finance",
            "Domain": "Data Science",
            "Tags": "Clustering, Data Analysis",
            "Technology_Stack": "Python, Excel, SQL, Scikit-Learn, SciPy, Pandas, NumPy, Seaborn, Matplotlib, Plotly",
            "Status": "Completed",
            "Link": "N/A"
        },
        {
            "Project_ID": "24",
            "Project_Name": "Adventureworks Sales Dashboard",
            "Project_TagLine": "A sales and revenue summary dashboard",
            "Summary": "Adventureworks Sales dashboard provides a single stop view at the company's sales and revenue over the years, helping them to make business decisions.",
            "Problem_Statement": "The idea is to create a dashboard which can visualize information related to sales, revenue, profits/losses for different products being soled by the company.\nThe dashboard should be able to visualize all necessary KPIs allowing business to make the necessary decisions.",
            "Solution_Provided": "A dashboard was created using PowerBI and DAX to visualize the organization's sales, revenue, profits and loss related data.\n\nThe dashboard offers the following support to the users:\na) High level views and detailed drill-down capabilities b) Sales/Revenue Visualization c) Simulations d) All KPIs clearly indicated",
            "Impact": "With a realtime dashboard at place, the following benefits were offered to the organization:\na) Visibility of KPIs b) Quick Decision Making c) Multi-level data view",
            "Organization": "Personal",
            "Role": "Lead Analyst, Data Scientist",
            "Client_Industry": "Retail",
            "Domain": "Data Science",
            "Tags": "Data Analysis, Data Visualization",
            "Technology_Stack": "Excel, SQL, PowerBI",
            "Status": "Completed",
            "Link": "N/A"
        }
    ]
}